#hierarchy -top kFPGACoreTop
#synth -top kFPGACoreTop
synth_xilinx -top kFPGACoreTop